# Задача 2.3.

# Напишите функцию, которая принимает цифры от 0 до 9 и возвращает значение прописью.
# Например,
# switch_it_up(1) -> 'One'
# switch_it_up(3) -> 'Three'
# switch_it_up(10000) -> None
# Использовать условный оператор if-elif-else нельзя!

# Решение:
# Без if не знаю как решить!!!!

def switch_it_up(number):

    
    if number == 0: print('Zero')
    if number == 1: print('One')
    if number == 2: print('Two')
    
switch_it_up(0)